# Core terminal setup
brew "git"
brew "starship"
brew "mise"

# Productivity tools
brew "fzf"
brew "zoxide"
brew "bat"
brew "eza"
brew "ripgrep"
brew "fd"
brew "tree"
brew "lazygit"

# Shell plugins
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Terminal
cask "iterm2"

# Fonts
cask "font-fira-code-nerd-font"